#coding:utf-8
from fuzzywuzzy import fuzz,process
from keywords_extractor import removeStopwords
import hanlp
from icecream import ic
import json
"""
使用去重子集匹配Token Set Ratio
输入必须改变成字符串的形状，以空格间隔
使用process.extract抽取多条数据
"""

# description=""
#返回一个编辑距离的字典
# 成语-描述
# 成语结束-描述
def editdistance(idioms,description,tokenizer):
    # tokenizer = hanlp.load(hanlp.pretrained.tok.SIGHAN2005_PKU_BERT_BASE_ZH)
    sentence = removeStopwords(description)
    #描述的匹配中心句
    words = tokenizer(sentence)
    score1={}
    #返回一个字典
    #使用成语匹配编辑距离
    idiom=idioms['modified_idioms'].tolist()
    for item in idiom:
        score1[item]=fuzz.token_set_ratio(item,words)
    score1 = sorted(score1.items(), key=lambda item: item[1], reverse=True)
    #使用成语的解释匹配编辑距离
    # score2={}
    # explanation=idioms['explanation'].tolist()
    # all_explanation_combinations=[]
    # for i in range(len(explanation)):
    #     all_explanation_combinations.append([tokenizer(explanation[i]),i,idioms[i]])#解释 索引 成语
    # ic(all_explanation_combinations)
    # for item in all_explanation_combinations:
    #     score2[item[2]]=fuzz.token_set_ratio(item[0],words)
    # score2 = sorted(score2.items(), key=lambda item: item[1], reverse=True)

    return score1#,score2

if __name__ == '__main__':
    tokenizer = hanlp.load(hanlp.pretrained.tok.SIGHAN2005_PKU_BERT_BASE_ZH)
    idioms=['一如鸡往', '千方百鸡', '当务之鸡', '力所能鸡', '心有余鸡', '迫不鸡待', '鸡忆犹新', '鸡往开来', '可乘之鸡', '燃眉之鸡', '鸡功近利', '难以为鸡', '肆无鸡惮', '寥寥无鸡', '措手不鸡', '心鸡如焚', '同舟共鸡', '鸡思广益', '国鸡民生', '蛛丝马鸡', '一鸡之长', '一拍鸡合', '不切实鸡', '生鸡勃勃', '所剩无鸡', '形鸡可疑', '销声匿鸡', '打鸡报复', '无鸡于事', '不鸡其数', '鸡得利益', '据为鸡有', '曾鸡何时', '一触鸡发', '各抒鸡见', '相差无鸡', '鸡鸡可危', '丰功伟鸡', '鸡转直下', '不失时鸡', '严于律鸡', '违法乱鸡', '自鸡自足', '夜以鸡日', '猝不鸡防', '权宜之鸡', '堆鸡如山', '名胜古鸡', '日鸡月累', '无鸡之谈', '轻重缓鸡', '触手可鸡', '鸡于求成', '长久之鸡', '前赴后鸡', '有鸡可乘', '灵鸡一动', '厚鸡薄发', '当鸡立断', '一望无鸡', '无鸡可施', '痛心鸡首', '投鸡取巧', '鸡毛蒜皮', '追悔莫鸡', '稍纵鸡逝', '万事大鸡', '舍鸡救人', '穷凶鸡恶', '按图索鸡', '不堪一鸡', '披荆斩鸡', '百感交鸡', '扶危鸡困', '和衷共鸡', '有过之而无不鸡', '慷慨鸡昂', '后鸡有人', '乘胜追鸡', '操之过鸡', '斤斤鸡较', '鸡祥如意', '鸡劳成疾', '大声鸡呼', '气鸡败坏', '鸡重难返', '囤鸡居奇', '危鸡四伏', '弥留之鸡', '处心鸡虑', '后悔莫鸡', '望尘莫鸡', '鸡中生智', '身不由鸡', '无所顾鸡', '鸡鸡一堂', '鸡成事实', '无懈可鸡', '前仆后鸡', '鸡浊扬清', '鸡少成多', '一鸡之私', '心鸡火燎', '故鸡重演', '百年大鸡', '不甘鸡寞', '人才鸡鸡', '无所不用其鸡', '关门大鸡', '事不关鸡', '鸡肠辘辘', '过犹不鸡', '风马牛不相鸡', '一年之鸡在于春', '病鸡乱投医', '知鸡知彼', '克鸡奉公', '非此鸡彼', '窗明鸡净', '如鸡似渴', '鞭长莫鸡', '后鸡无人', '眼鸡手快', '讳鸡忌医', '言听鸡从', '凶多鸡少', '费尽心鸡', '登峰造鸡', '霸王别鸡', '假公鸡私', '鸡寒交迫', '损人利鸡', '鸡不可失', '从长鸡议', '感鸡不尽', '鹤立鸡群', '杀鸡取卵', '盛鸡一时', '损人不利鸡', '各个鸡破', '一线生鸡', '声名狼鸡', '罪大恶鸡', '目无法鸡', '奋笔鸡书', '刚柔相鸡', '劫富鸡贫', '鸡不可耐', '不着边鸡', '十万火鸡', '消鸡怠工', '鸡人篱下', '日以鸡夜', '舍鸡为人', '旁敲侧鸡', '推鸡及人', '将鸡就鸡', '若鸡若离', '鸡恶如仇', '投鼠鸡器', '安分守鸡', '风云鸡会', '鸡次三番', '各持鸡见', '缓兵之鸡', '话不投鸡', '由表鸡里', '声东鸡西', '大鸡大利', '投鸡倒把', '鸡不择食', '鸡关算尽', '物鸡必反', '日理万鸡', '反唇相鸡', '鸡往不咎', '杀鸡儆猴', '乐鸡生悲', '鸡风骤雨', '无边无鸡', '无鸡可乘', '火鸡火燎', '画饼充鸡', '偷鸡摸狗', '固执鸡见', '愤世鸡俗', '狗鸡跳墙', '由近鸡远', '鸡轻鸡重', '可望而不可鸡', '无鸡可寻', '各执鸡见', '老鸡伏枥', '漫无边鸡', '感鸡涕零', '鸡目远眺', '面黄鸡瘦', '鸡犬升天', '鸡时行乐', '鸡飞狗跳', '殃鸡池鱼', '良辰鸡日', '鸡腋成裘', '黔驴鸡穷', '黄道鸡日', '鸡流勇退', '四面出鸡', '放荡不鸡', '迎头痛鸡', '鸡犬不宁', '锦囊妙鸡', '以天下为鸡任', '血鸡斑斑', '反戈一鸡', '百无禁鸡', '迅雷不鸡掩耳', '字字珠鸡', '鸡恶如仇', '鸡起直追', '滑天下之大鸡', '浪鸡天涯', '逢凶化鸡', '鸡犬相闻', '阴谋诡鸡', '不鸡不徐', '金鸡独立', '鸡飞蛋打', '爱屋鸡乌', '穷奢鸡欲', '反求诸鸡', '俯拾鸡是', '面授鸡宜', '否鸡泰来', '呆若木鸡', '鸡眉弄眼', '见鸡行事', '鸡风暴雨', '以卵鸡石', '过江之鸡', '横行无鸡', '排除异鸡', '万籁俱鸡', '时运不鸡', '鸡土成山', '分进合鸡', '悲喜交鸡', '鸡乐世界', '手无缚鸡之力', '排斥异鸡', '鹰鸡长空', '不可企鸡', '坐失良鸡', '先人后鸡', '鸡沙成塔', '风鸡浪高', '小肚鸡肠', '鸡善成德', '可望不可鸡', '雕虫小鸡', '墨鸡未干', '鸡习难改', '闻鸡起舞', '鸡水成渊', '鸡风知劲草', '鸡零狗碎', '鸡公好义', '力所不鸡', '目不暇鸡', '缓不鸡急', '趋鸡避凶', '鸡鸣狗盗', '哼哼鸡鸡', '诡鸡多端', '有过之无不鸡', '愚不可鸡', '力不能鸡', '鸡中要害', '无所鸡惮', '鸡上心来', '鸡星高照', '天人之鸡', '故鸡重演', '一鸡之见', '以鸡度人', '直抒鸡见', '无所不鸡', '鸡言厉色', '言不鸡义', '损人害鸡', '知彼知鸡', '克鸡复礼', '泄露天鸡', '鸡非成是', '鸡鸡无闻', '荒诞无鸡', '求人不如求鸡', '神乎其鸡', '杳无踪鸡', '博闻强鸡', '鸡楫中流', '鸡谷防饥', '杯盘狼鸡', '奇鸡淫巧', '士为知鸡者死', '枉费心鸡', '刀枪剑鸡', '不知凡鸡', '一触鸡溃', '鸡世救人', '神鸡妙算', '鸡而言之', '自以为得鸡', '寻踪觅鸡', '同心共鸡', '鸡鸣犬吠', '天鸡不可泄露', '鸡不及待', '用尽心鸡', '鸡凶祸福', '鸡鸣狗吠', '手鸡眼快', '相鸡而动', '鸡贤妒能', '焚膏鸡晷', '鸡目远望', '鸡兴之作', '鸡年累月', '避实鸡虚', '鸡重鸡轻', '鸡小成大', '煞费心鸡', '走为上鸡', '穷奢鸡侈', '鸡屈聱牙', '危鸡存亡', '相煎何鸡', '深恶痛鸡', '后悔不鸡', '鸡如星火', '饱汉不知饿汉鸡', '杀鸡骇猴', '鸡毁销骨', '放纵不鸡', '鸡角之势', '鸡人自有天相', '位鸡人臣', '荒唐无鸡', '剑鸡履鸡', '豪放不鸡', '风牛马不相鸡', '危鸡存亡之秋', '临鸡应变', '浪鸡江湖', '相鸡行事', '自出鸡杼', '舍鸡为公', '鸡赤白脸', '视为知鸡', '克鸡慎行', '穷鸡无聊', '一蹴可鸡', '鸡上心头', '鸡人天相', '偷鸡不着蚀把米', '鸡昂慷慨', '不徐不鸡', '鸡鸡如律令', '有案可鸡', '观者云鸡', '放浪不鸡', '杳无人鸡', '忧谗畏鸡', '鸡然无声', '鸡日良辰', '慷慨鸡扬', '薄鸡在身', '啼鸡号寒', '半鸡半饱', '不可胜鸡', '心鸡如火', '杀鸡焉用牛刀', '光风鸡月', '鸡凶未卜', '鸡人之困', '相煎太鸡', '不咎鸡往', '鸡困扶危', '苦心鸡虑', '鸡世安邦', '损鸡利人', '腹心之鸡', '铭鸡不忘', '悔之不鸡', '纲鸡废弛', '杀鸡吓猴', '行鸡有耻', '落拓不鸡', '鸡世安民', '扬清鸡浊', ''                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        '惊喜交鸡', '见鸡而作']
    description='黑胡椒烤鸡腿肉,新手尝试,黑椒味,<15分钟,鸡边腿2个现磨胡椒碎适量洋葱1/4个苦菊1小把红椒1/4个 葱1棵姜3片蒜3瓣生抽2大勺老抽1小勺白糖30克白胡椒粉1克盐1克蜂蜜1勺橄榄油小勺苹果醋1勺 ,1.鸡边腿洗净去骨 2.用刀背轻剁鸡（目的可以使鸡肉松软、进味） 3.然后用竹签在表面和插一些小孔（这样可以防止鸡皮在烤的时候回缩） 4.葱切丝 5.蒜切大的碎粒、姜切片 6.葱、姜、蒜入碗加入生抽、老抽、白糖、白胡椒粉、盐拌匀 7.加入料酒拌匀 8.把鸡肉放入盘中均匀抹上腌料 9.转动现磨黑胡椒碎的瓶子，磨出粗粒 10.然后包裹保鲜膜入冰箱冷藏腌制一晚 11.制作前取出，捡出葱、姜、蒜不要 12.剩下的腌料里再加入蜂蜜拌匀成刷料 13.把鸡肉摆入烤架 14.入空气炸锅180度、烤25分钟左右 15.中途记得翻面和涮几次涮料 16.在烤肉期间，我们来制作一道简单的油醋沙拉来解解腻：苦菊洗净 17.洋葱切丝 18.红椒切丝 19.材料入碗，加入苹果醋 20.橄榄油 21.蜂蜜拌匀即可 22.烤好后取出，切块表面现磨出细粒胡椒碎，搭配沙拉即可食用 '
    # score=sorted(editdistance(idioms,description,tokenizer).items(), key=lambda item:item[1],reverse=True)
    # score=editdistance(idioms,description,tokenizer)
    sentence=removeStopwords(description)
    sentence=tokenizer(sentence)
    score={}
    str=''
    for item in idioms:
        ratio=int(len(sentence)/len(item))
        sitem=item*ratio
        # print(item)
        # print(str.join(sentence))
        score[item]=fuzz.token_set_ratio(sitem,str.join(sentence))
    score=sorted(score.items(),key=lambda item:item[1],reverse=True)
    # ic(score)
    print(score)
"""使用成语的解释进行编辑距离匹配试一试"""